#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnsimple_record.myobie_com_caa_email will be created
  + resource "dnsimple_record" "myobie_com_caa_email" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "0"
      + ttl       = "3600"
      + type      = "CAA"
      + value     = "0 iodef \"mailto:me@nathanherald.com\""
    }

  # dnsimple_record.myobie_com_caa_provider will be created
  + resource "dnsimple_record" "myobie_com_caa_provider" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "0"
      + ttl       = "3600"
      + type      = "CAA"
      + value     = "0 issue \"letsencrypt.org\""
    }

  # dnsimple_record.myobie_com_mx_1_soverin will be created
  + resource "dnsimple_record" "myobie_com_mx_1_soverin" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "1"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "mx.soverin.net"
    }

  # dnsimple_record.myobie_com_mx_2_soverin will be created
  + resource "dnsimple_record" "myobie_com_mx_2_soverin" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "2"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "mx02.soverin.net"
    }

  # dnsimple_record.myobie_com_mx_3_soverin will be created
  + resource "dnsimple_record" "myobie_com_mx_3_soverin" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "3"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "mx03.soverin.net"
    }

  # dnsimple_record.myobie_com_root_alias will be created
  + resource "dnsimple_record" "myobie_com_root_alias" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "ALIAS"
      + value     = "alias.zeit.co"
    }

  # dnsimple_record.myobie_com_txt_soverin_spf will be created
  + resource "dnsimple_record" "myobie_com_txt_soverin_spf" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "v=spf1 +a include:soverin.net ~all"
    }

  # dnsimple_record.myobie_com_txt_soverin_verificaton will be created
  + resource "dnsimple_record" "myobie_com_txt_soverin_verificaton" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "Soverin=2gPmdBHiez5h58uy"
    }

  # dnsimple_record.myobie_com_www_cname will be created
  + resource "dnsimple_record" "myobie_com_www_cname" {
      + domain    = "myobie.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "www"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "CNAME"
      + value     = "alias.zeit.co"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `default`*
